frontend/models/PostsQuery.php

SELECT title `id` FROM `posts` WHERE posted_by != 0 and posted_by !=  ""
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM `posts` WHERE `id`='10'
---
    public function findAll(){

        $model = Posts::find()->all();